---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionWithCommonLengthUnit
source: html/010ac28a-d4d0-b299-a464-7c1fba8c0653.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionWithCommonLengthUnit Property

A shape dimension is labelled with a parameter that uses the Common Length unit.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionWithCommonLengthUnit { get; }
```